posts/review-of-2110-06674-truthful-ai-developing-and-governing-ai-that-does-not-lie.org
#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}
#+OPTIONS: toc:nil

#+HUGO_BASE_DIR: /home/shane/var/smulliga/source/git/semiosis/semiosis-hugo
#+HUGO_SECTION: ./posts

#+TITLE: Review of '[2110.06674] Truthful AI: Developing and governing AI that does not lie'
#+DATE: <2021-10-15>
#+AUTHOR: Shane Mulligan
#+KEYWORDS: alethiology epistemology

** Summary
This is my notebook as I go through this paper.

+ Original article :: [[https://arxiv.org/abs/2110.06674][ 2110.06674  Truthful AI: Developing and governing AI that does not lie]]

+ Truth :: https://en.wikipedia.org/wiki/Truth

I have not yet read the paper, but this page will serve as my notes for it.

** Types of truth
This is a work-in-progress.

| Types          | Mentioned   | Other Possible candidates              |
|----------------+-------------+----------------------------------------|
| Correspondence |             |                                        |
| Coherence      |             | Language model                         |
| Pragmatic      |             | Interrogating language model           |
| Constructivist | Institution | Blockchain for training data accretion |
| Consensus      |             | Blockchain for trained models          |
| Deflationary   |             |                                        |
| Performative   |             |                                        |

*** No mention of blockchain
Here are my previous notes on base-truth via language models on the blockchain.

- https://mullikine.github.io/posts/language-models-as-truth/