content/posts/review-of-2110-06674-truthful-ai-developing-and-governing-ai-that-does-not-lie.md
+++
title = "Review of '[2110.06674] Truthful AI: Developing and governing AI that does not lie'"
author = ["Shane Mulligan"]
date = 2021-10-15T00:00:00+13:00
keywords = ["alethiology", "epistemology"]
draft = false
+++

## Summary {#summary}

This is my notebook as I go through this paper.

Original article
: [ 2110.06674  Truthful AI: Developing and governing AI that does not lie](https://arxiv.org/abs/2110.06674)


Truth
: <https://en.wikipedia.org/wiki/Truth>

I have not yet read the paper, but this page will serve as my notes for it.


## Types of truth {#types-of-truth}

This is a work-in-progress.

| Types          | Mentioned   | Other Possible candidates              |
|----------------|-------------|----------------------------------------|
| Correspondence |             |                                        |
| Coherence      |             | Language model                         |
| Pragmatic      |             | Interrogating language model           |
| Constructivist | Institution | Blockchain for training data accretion |
| Consensus      |             | Blockchain for trained models          |
| Deflationary   |             |                                        |
| Performative   |             |                                        |


### No mention of blockchain {#no-mention-of-blockchain}

Here are my previous notes on base-truth via language models on the blockchain.

-   <https://mullikine.github.io/posts/language-models-as-truth/>